content/posts/Process-relational_philosophy_by_C_Robert_Mesle_in_2008.md
+++
title = "Process-relational philosophy by C. Robert Mesle in 2008"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:39-04:00
slug = "Process-relational_philosophy_by_C_Robert_Mesle_in_2008"
draft = false
+++

## 1. A process-relational world: an adventure that matters {#1-dot-a-process-relational-world-an-adventure-that-matters}


### Ideas shape actions, so it matters how we think about reality, the world, and ourselves. I don’t mean that only people who believe in one particular religion or philosophy can be good or intelligent people. {#ideas-shape-actions-so-it-matters-how-we-think-about-reality-the-world-and-ourselves-dot-i-don-t-mean-that-only-people-who-believe-in-one-particular-religion-or-philosophy-can-be-good-or-intelligent-people-dot}


## 2. Imaginative generalization: the search for a comprehensive vision {#2-dot-imaginative-generalization-the-search-for-a-comprehensive-vision}


## 3. Minds, bodies, and experience: envisioning a unified self {#3-dot-minds-bodies-and-experience-envisioning-a-unified-self}


## 4. Experience all the way down: seeking an imaginative leap {#4-dot-experience-all-the-way-down-seeking-an-imaginative-leap}


## 5. Reality as relational process: substance and process {#5-dot-reality-as-relational-process-substance-and-process}


## 6. Reality as a causal web: a constructive postmodernism {#6-dot-reality-as-a-causal-web-a-constructive-postmodernism}


## 7. Unilateral power: power, value, and reality {#7-dot-unilateral-power-power-value-and-reality}


## 8. Relational power: so what? {#8-dot-relational-power-so-what}


## 9. Creativity, freedom, and God: what makes freedom possible? {#9-dot-creativity-freedom-and-god-what-makes-freedom-possible}


###  {#}


## 10. Looking ahead: the future of process-relational thought {#10-dot-looking-ahead-the-future-of-process-relational-thought}


## Appendix: Whitehead's language {#appendix-whitehead-s-language}


### [Whitehead's conceptual vocabulary for process philosophy]({{< relref "Whitehead's_conceptual_vocabulary_for_process_philosophy" >}}) {#whitehead-s-conceptual-vocabulary-for-process-philosophy--whitehead-s-conceptual-vocabulary-for-process-philosophy-dot-md}


##  {#}
